--by Lamiale 感谢各位在编写过程中帮助过我的大佬


command = {}
do
    local elem = {
"氢，H，hydrogen，原子序数1，相对原子质量1.00794，基态原子电子组态1s1，熔点-259.14℃/14.01K，沸点-252.87℃/20.28K。常见化合价+1、-1。密度0.0000899g/cm^3。电负度2.2。",

"氦，He，helium，原子序数2，相对原子质量4.0026，基态原子电子组态1s2，熔点-272.2℃/0.95K，沸点-268.9℃/4.25K。0族。密度0.00017846g/cm^3。",
    
"锂，Li，lithium，原子序数3，相对原子质量6.941，基态原子电子组态[He] 2s1，熔点180.5℃/453.65K，沸点1342℃/1615.15K。IA族，常见化合价+1。密度0.534g/cm^3。电负度0.98。",
    
"铍，Be，beryllium，原子序数4，相对原子质量9.0121，基态原子电子组态[He] 2s2，熔点1278℃/1551.15K，沸点2970℃/3243.15K。IIA族，常见化合价+2。密度1.848g/cm^3。电负度1.57。",
    
"硼，B，boron，原子序数5，相对原子质量10.811，基态原子电子组态[He] 2s2 2p1，熔点2017.8℃/2348.95K，沸点3926.8℃/4199.95K。IIIA族，常见化合价+3。密度2.34g/cm^3。电负度2.04。",
    
"碳，C，carbon，原子序数6，相对原子质量12.0107，基态原子电子组态[He] 2s2 2p2，熔点3550℃/3823.15K，沸点4827℃/5100.15K。IVA族，常见化合价-4、+4。密度2.26g/cm^3。电负度2.55。",
    
"氮，N，nitrogen，原子序数7，相对原子质量14.0067，基态原子电子组态[He] 2s2 2p3，熔点-209.9℃/63.25K，沸点-195.8℃/77.35K。VA族，常见化合价-3。密度0.001251g/cm^3。电负度3.04。",
    
"氧，O，oxygen，原子序数8，相对原子质量15.9994，基态原子电子组态[He] 2s2 2p4，熔点-218.79℃/54.36K，沸点-182.96℃/90.19K。VIA族，常见化合价-2。密度0.00142897g/cm^3。电负度3.44。",
    
"氟，F，fluorine，原子序数9，相对原子质量18.9984，基态原子电子组态[He] 2s2 2p5，熔点-219.67℃/53.48K，沸点-188.11℃/85.04K。VIIA族，常见化合价-1。密度0.001696g/cm^3。电负度3.98。",
    
"氖，Ne，neon，原子序数10，相对原子质量20.1797，基态原子电子组态[He] 2s2 2p6，熔点-248.67℃/24.48K，沸点-246.05℃/27.1K。0族。密度0.0009002g/cm^3。",
    
"钠，Na，sodium，原子序数11，相对原子质量22.9897，基态原子电子组态[Ne] 3s1，熔点97.8℃/370.95K，沸点882.94℃/1156.09K。IA族，常见化合价+1。密度0.971g/cm^3。电负度0.93。",
    
"镁，Mg，magnesium，原子序数12，相对原子质量24.3050，基态原子电子组态[Ne] 3s2，熔点650℃/923.15K，沸点1090℃/1363.15K。IIA族，常见化合价+2。密度1.738g/cm^3。电负度1.31。",
    
"铝，Al，aluminium，原子序数13，相对原子质量26.9815，基态原子电子组态[Ne] 3s2 3p1，熔点660℃/933.15K，沸点2518.82℃/2791.97K。IIIA族，常见化合价+3。密度2.6989g/cm^3。电负度1.61。",
    
"硅，Si，silicon，原子序数14，相对原子质量28.0855，基态原子电子组态[Ne] 3s2 3p2，熔点1414.85℃/1688K，沸点3265℃/3538.15K。IVA族，常见化合价-4、+4。密度2.33g/cm^3。电负度1.9。",
    
"磷，P，phosphorus，原子序数15，相对原子质量30.9737，基态原子电子组态[Ne] 3s2 3p3，熔点44.15℃/317.3K，沸点280.5℃/553.65K。VA族，常见化合价-3、+3、+5。密度2.82g/cm^3。电负度2.19。",
    
"硫，S，sulfur/sulphur，原子序数16，相对原子质量32.065，基态原子电子组态[Ne] 3s2 3p4，熔点112.8℃/385.95K，沸点444.67℃/717.82K。VIA族，常见化合价-2、+2、+4、+6。密度2.070g/cm^3。电负度2.58。",
    
"氯，Cl，chlorine，原子序数17，相对原子质量35.453，基态原子电子组态[Ne] 3s2 3p5，熔点-100.98℃/172.17K，沸点-34.6℃/238.55K。VIIA族，常见化合价-1。密度0.003214g/cm^3。电负度3.16。",
    
"氩，Ar，argon，原子序数18，相对原子质量39.948，基态原子电子组态[Ne] 3s2 3p6，熔点-189.34℃/83.81K，沸点-185.85℃/87.3K。0族。密度0.001784g/cm^3。",
    
"钾，K，potassium，原子序数19，相对原子质量39.0983，基态原子电子组态[Ar] 4s1，熔点63.38℃/336.53K，沸点758.8℃/1031.95K。IA族，常见化合价+1。密度0.856g/cm^3。电负度0.82。",
    
"钙，Ca，calcium，原子序数20，相对原子质量40.078，基态原子电子组态[Ar] 4s2，熔点842℃/1115.15K，沸点1484℃/1757.15K。IIA族，常见化合价+2。密度1.55g/cm^3。电负度1。",
    
"钪，Sc，scandium，原子序数21，相对原子质量44.9559，基态原子电子组态[Ar] 3d1 4s2，熔点1541℃/1814.15K，沸点2836℃/3109.15K。IIIB族，常见化合价+3。密度2.99g/cm^3。电负度1.36。",
    
"钛，Ti，titanium，原子序数22，相对原子质量47.867，基态原子电子组态[Ar] 3d2 4s2，熔点1660℃/1933.15K，沸点3287℃/3560.15K。IVB族，常见化合价+3、+4。密度4.54g/cm^3。电负度1.54。",
    
"钒，V，vanadium，原子序数23，相对原子质量50.9415，基态原子电子组态[Ar] 3d3 4s2，熔点1910℃/2183.15K，沸点3407℃/3680.15K。VB族，常见化合价+2、+3、+4、+5。密度6.11g/cm^3。电负度1.63。",
    
"铬，Cr，chromium，原子序数24，相对原子质量51.9961，基态原子电子组态[Ar] 3d5 4s1，熔点1907℃/2180.15K，沸点2672℃/2945.15K。VIB族，常见化合价+2、+3、+6。密度7.19g/cm^3。电负度1.66。",
    
"锰，Mn，manganese，原子序数25，相对原子质量54.9380，基态原子电子组态[Ar] 3d5 4s2，熔点1245℃/1518.15K，沸点2061℃/2334.15K。VIIB族，常见化合价+2、+4、+7。密度7.21g/cm^3。电负度1.55。",
    
"铁，Fe，iron，原子序数26，相对原子质量55.845，基态原子电子组态[Ar] 3d6 4s2，熔点1539℃/1812.15K，沸点2862℃/3135.15K。VIIIB族，常见化合价+2、+3。密度7.88g/cm^3。电负度1.83。发生聚变反应不会有能量放出的元素。",
    
"钴，Co，cobalt，原子序数27，相对原子质量58.9331，基态原子电子组态[Ar] 3d7 4s2，熔点1493℃/1766.15K，沸点2870℃/3143.15K。VIIIB族，常见化合价+2、+3。密度8.9g/cm^3。电负度1.88。",
    
"镍，Ni，nickel，原子序数28，相对原子质量58.6934，基态原子电子组态[Ar] 3d8 4s2，熔点1455℃/1728.15K，沸点2915℃/3188.15K。VIIIB族，常见化合价+2。密度8.902g/cm^3。电负度1.91。",
    
"铜，Cu，copper，原子序数29，相对原子质量63.546，基态原子电子组态[Ar] 3d10 4s1，熔点1084.62℃/1357.77K，沸点2562℃/2835.15K。IB族，常见化合价+1、+2。密度8.92g/cm^3。电负度1.9。",
    
"锌，Zn，zinc，原子序数30，相对原子质量65.409，基态原子电子组态[Ar] 3d10 4s2，熔点419.5℃/692.65K，沸点906℃/1179.15K。IIB族，常见化合价+2。密度7.133g/cm^3。电负度1.65。",
    
"镓，Ga，gallium，原子序数31，相对原子质量69.723，基态原子电子组态[Ar] 3d10 4s2 4p1，熔点29.8℃/302.95K，沸点2203℃/2476.15K。IIIA族，常见化合价+3。密度5.91g/cm^3。电负度1.81。",
    
"锗，Ge，germanium，原子序数32，相对原子质量72.64，基态原子电子组态[Ar] 3d10 4s2 4p2，熔点937.5℃/1210.65K，沸点2833℃/3106.15K。IVA族，常见化合价-4、+2、+4。密度5.323g/cm^3。电负度2.01。",
    
"砷，As，arsenic，原子序数33，相对原子质量74.9216，基态原子电子组态[Ar] 3d10 4s2 4p3，熔点816.8℃/1089.95K，沸点613℃/886.15K。VA族，常见化合价-3、+3、+5。密度5.72g/cm^3。电负度2.18。",
    
"硒，Se，selenium，原子序数34，相对原子质量78.96，基态原子电子组态[Ar] 3d10 4s2 4p4，熔点217℃/490.15K，沸点684.8℃/957.95K。VIA族，常见化合价-2、+4、+6。密度4.79g/cm^3。电负度2.55。",
    
"溴，Br，bromine，原子序数35，相对原子质量79.904，基态原子电子组态[Ar] 3d10 4s2 4p5，熔点-7.25℃/265.9K，沸点58.8℃/331.95K。VIIA族，常见化合价-1。密度3.14g/cm^3。电负度2.96。",
    
"氪，Kr，krypton，原子序数36，相对原子质量83.798，基态原子电子组态[Ar] 3d10 4s2 4p6，熔点-157.37℃/115.78K，沸点-153.4℃/119.75K。0族，常见化合价0。密度0.003749g/cm^3。电负度3。",
    
"铷，Rb，rubidium，原子序数37，相对原子质量85.467，基态原子电子组态[Kr] 5s1，熔点39.32℃/312.47K，沸点687.2℃/960.35K。IA族，常见化合价+1。密度1.53g/cm^3。电负度0.82。",
    
"锶，Sr，strontium，原子序数38，相对原子质量87.62，基态原子电子组态[Kr] 5s2，熔点777℃/1050.15K，沸点1382℃/1655.15K。IIA族，常见化合价+2。密度2.54g/cm^3。电负度0.95。",
    
"钇，Y，yttrium，原子序数39，，相对原子质量88.905，基态原子电子组态[Kr] 4d1 5s2，熔点1526℃/1799.15K，沸点3338℃/3611.15K。IIIB族，常见化合价+3。密度4.47g/cm^3。电负度1.22。",
    
"锆，Zr，ziroconium，原子序数40，相对原子质量91.224，基态原子电子组态[Kr] 4d2 5s2，熔点1855℃/2128.15K，沸点4409℃/4682.15K。IVB族，常见化合价+4。密度6.51g/cm^3。电负度1.33。",
    
"铌，Nb，niobium，原子序数41，相对原子质量92.906，基态原子电子组态[Kr] 4d4 5s1，熔点2477℃/2750.15K，沸点4927℃/5200.15K。VB族，常见化合+3、+5。密度8.58g/cm^3。电负度1.6。",
    
"钼，Mo，molybdenum，原子序数42，相对原子质量95.94，基态原子电子组态[Kr] 4d5 5s1，熔点2623℃/2896.15K，沸点4639℃/4912.15K。VIB族，常见化合价+6。密度10.22g/cm^3。电负度2.16。",
    
"锝，Tc，technetium，原子序数43，相对原子质量98.906，基态原子电子组态[Kr] 4d5 5s2，熔点2157℃/2430.15K，沸点4265℃/4538.15K。VIIB族，常见化合价+4、+6、+7。密度11.49g/cm^3。电负度1.9。",
    
"钌，Ru，ruthenium，原子序数44，相对原子质量101.07，基态原子电子组态[Kr] 4d7 5s1，熔点2334℃/2607.15K，沸点4077℃/4350.15K。VIIIB族，常见化合价+3。密度12.41g/cm^3。电负度2.2。",
    
"铑，Rh，rhodium，原子序数45，相对原子质量102.905，基态原子电子组态[Kr] 4d8 5s1，熔点1964℃/2237.15K，沸点3727℃/4000.15K。VIIIB族，常见化合价+3。密度12.41g/cm^3。电负度2.28。",
    
"钯，Pd，palladium，原子序数46，相对原子质量106.42，基态原子电子组态[Kr] 4d10，熔点1555℃/1828.15K，沸点2963℃/3236.15K。VIIIB族，常见化合价+2、+4。密度12.02g/cm^3。电负度2.2。",
    
"银，Ag，silver，原子序数47，相对原子质量107.868，基态原子电子组态[Kr] 4d10 5s1，熔点961.8℃/1234.95K，沸点2162℃/2435.15K。IB族，常见化合价+1。密度10.49g/cm^3。电负度1.93。",
    
"镉，Cd，cadmium，原子序数48，相对原子质量112.411，基态原子电子组态[Kr] 4d10 5s2，熔点319.1℃/592.25K，沸点766.8℃/1039.95K。IIB族，常见化合价+2。密度8.64g/cm^3。电负度1.69。",
    
"铟，In，indium，原子序数49，相对原子质量114.818，基态原子电子组态[Kr] 4d10 5s2 5p1，熔点156.6℃/429.75K，沸点2072℃/2345.15K。IIIA族，常见化合价+3。密度7.31g/cm^3。电负度1.78。",
    
"锡，Sn，tin，原子序数50，相对原子质量118.710，基态原子电子组态[Kr] 4d10 5s2 5p2，熔点231.91℃/505.08K，沸点2602℃/2875.15K。IVA族，常见化合价+2、+4。密度7.29g/cm^3。电负度1.96。",
    
"锑，Sb，antimony，原子序数51，相对原子质量121.760，基态原子电子组态[Kr] 4d10 5s2 5p3，熔点630.75℃/903.9K，沸点1587℃/1860.15K。VA族，常见化合价-3、+3、+5。密度6.69g/cm^3。电负度2.05。",
    
"碲，Te，tellurium，原子序数52，相对原子质量127.60，基态原子电子组态[Kr] 4d10 5s2 5p4，熔点449.55℃/722.7K，沸点987.8℃/722.7K。VIA族，常见化合价-2、+4、+6。密度6.25g/cm^3。电负度2.1。",

"碘，I，iodine，原子序数53，相对原子质量126.904，基态原子电子组态[Kr] 4d10 5s2 5p5，熔点113.55℃/386.7K，沸点184.35℃/457.5K。VIIA族，常见化合价-1。密度4.94g/cm^3。电负度2.66。",
    
"氙，Xe，xenon，原子序数54，相对原子质量131.293，基态原子电子组态[Kr] 4d10 5s2 5p6，熔点-111.8℃/161.35K，沸点-108.1℃/165.05K。0族。密度0.005894g/cm^3。电负度2.6。",
    
"铯，Cs，caesium，原子序数55，相对原子质量132.905，基态原子电子组态[Xe] 6s1，熔点28.45℃/301.6K，沸点670.8℃/943.95K。IA族，常见化合价+1。密度1.9g/cm^3。电负度0.79。",
    
"钡，Ba，barium，原子序数56，相对原子质量137.327，基态原子电子组态[Xe] 6s2，熔点727℃/1000.15K，沸点1897℃/2170.15K。IIA族，常见化合价+2。密度3.5g/cm^3。电负度0.89。",
    
"镧，La，lanthanium，原子序数57，相对原子质量138.905，基态原子电子组态[Xe] 5d1 6s2，熔点920℃/1193.15K，沸点3464℃/3737.15K。IIIB族，常见化合价+3。密度6.16g/cm^3。电负度1.1。",
    
"铈，Ce，cerium，原子序数58，相对原子质量140.116，基态原子电子组态[Xe] 4f1 5d1 6s2，熔点795℃/1068.15K，沸点3443℃/3716.15K。常见化合价+3、+4。密度6.77g/cm^3。电负度1.12。",
    
"镨，Pr，praseodynium，原子序数59，相对原子质量140.904，基态原子电子组态[Xe] 4f3 6s2，熔点931℃/1204.15K，沸点3512℃/3785.15K。常见化合价+3。密度6.773g/cm^3。电负度1.13。",
    
"钕，Nd，Neodynium，原子序数60，相对原子质量144.242，基态原子电子组态[Xe] 4f4 6s2，熔点1010℃/1285.15K，沸点3074℃/3347.15K。常见化合价+3。密度7g/cm^3。电负度1.14。",
    
"钷，Pm，promethium，原子序数61，相对原子质量144.912，基态原子电子组态[Xe] 4f5 6s2，熔点1167℃/1440.15K，沸点3000℃/3273.15K。常见化合价+3。密度7.2g/cm^3。",
    
"钐，Sm，samarium，原子序数62，相对原子质量150.36，基态原子电子组态[Xe] 4f6 6s2，熔点1072℃/1345.15K，沸点1794℃/2067.15K。常见化合价+2、+3。密度7.54g/cm^3。电负度1.1。",
    
"铕，Eu，europium，原子序数63，相对原子质量151.964，基态原子电子组态[Xe] 4f7 6s2，熔点822℃/1095.15K，沸点1597℃/1870.15K。常见化合价+2、+3。密度5.25g/cm^3。",
    
"钆，Gd，gadolinium，原子序数64，相对原子质量157.25，基态原子电子组态[Xe] 4f7 5d1 6s2，熔点1311℃/1584.15K，沸点3272℃/3545.15K。常见化合价+3。密度7.89g/cm^3。电负度1.2。",
    
"铽，Tb，terbium，原子序数65，相对原子质量158.925，基态原子电子组态[Xe] 4f9 6s2，熔点1360℃/1633.15K，沸点3227℃/3500.15K。常见化合价+3。密度8.25g/cm^3。",
    
"镝，Dy，dysprosium，原子序数66，相对原子质量165.500，基态原子电子组态[Xe] 4f10 6s2，熔点1409℃/1682.15K，沸点2567℃/2840.15K。常见化合价+3。密度8.56g/cm^3。电负度1.22。",
    
"钬，Ho，holmium，原子序数67，相对原子质量164.93，基态原子电子组态[Xe] 4f11 6s2，熔点1470℃/1743.15K，沸点2695℃/2968.15K。常见化合价+3。密度8.78g/cm^3。电负度1.23。",
    
"铒，Er，erbium，原子序数68，相对原子质量167.259，基态原子电子组态[Xe] 4f12 6s2，熔点1529℃/1802.15K，沸点2867℃/3140.15K。常见化合价+3。密度9.05g/cm^3。电负度1.24。",
    
"铥，Tm，thulium，原子序数69，相对原子质量168.934，基态原子电子组态[Xe] 4f13 6s2，熔点1545℃/1818.15K，沸点1947℃/2220.15K。常见化合价+3。密度9.32g/cm^3。电负度1.25。",

"镱，Yb，ytterbium，原子序数70，相对原子质量173.04，基态原子电子组态[Xe] 4f14 6s2，熔点824℃/1097.15K，沸点1193℃/1488.15K。常见化合价+2、+3。密度6.97g/cm^3。",
    
"镥，Lu，lutenium，原子序数71，相对原子质量174.967，基态原子电子组态[Xe] 4f14 5d1 6s2，熔点1663℃/1936.15K，沸点3395℃/3668.15K。常见化合价+3。密度9.84g/cm^3。电负度1.27。",
    
"铪，Hf，hafnium，原子序数72，相对原子质量178.49，基态原子电子组态[Xe] 4f14 5d2 6s2，熔点2233℃/2506.15K，沸点4602℃/4875.15K。IVB族，常见化合价+4。密度13.31g/cm^3。电负度1.3。",
    
"钽，Ta，tantalium，原子序数73，相对原子质量180.947，基态原子电子组态[Xe] 4f14 5d3 6s2，熔点3017℃/3290.15K，沸点5458℃/5731.15K。VB族，常见化合价+5。密度16.68g/cm^3。电负度1.5。",

"钨，W，tungsten，原子序数74，相对原子质量183.84，基态原子电子组态[Xe] 4f14 5d4 6s2，熔点3422℃/3695.15K，沸点5555℃/5828.15K。VIB族，常见化合价+6。密度19.26g/cm^3。电负度2.36。",

"铼，Re，rhenium，原子序数75，相对原子质量186.207，基态原子电子组态[Xe] 4f14 5d5 6s2，熔点3180℃/3453.15K，沸点5627℃/5900.15K。VIIB族，常见化合价+4、+6、+7。密度21.03g/cm^3。电负度1.9。",
    
"锇，Os，osmium，原子序数76，相对原子质量190.23，基态原子电子组态[Xe] 4f14 5d6 6s2，熔点3033℃/3306.15K，沸点5597℃/5870.15K。VIIIB族，常见化合价+3、+4。密度22.587g/cm^3。电负度2.2。",
    
"铱，Ir，iridium，原子序数77，相对原子质量192.217，基态原子电子组态[Xe] 4f14 5d7 6s2，熔点2410℃/2683.15K，沸点4130℃/4403.15K。VIIB族，常见化合价+3、+4。密度22.562g/cm^3。电负度2.2。",
    
"铂，Pt，platium，原子序数78，相对原子质量195.084，基态原子电子组态[Xe] 4f14 5d9 6s1，熔点1768℃/2041.15K，沸点3825℃/4098.15K。VIIIB族，常见化合价+2、+4。密度21.45g/cm^3。电负度2.28。",
    
"金，Au，gold，原子序数79，相对原子质量196.966，基态原子电子组态[Xe] 4f14 5d10 6s1，熔点1064.43℃/1337.58K，沸点2700℃/2973.15K。IB族，常见化合价+1、+3。密度19.3g/cm^3。电负度2.54。",
    
"汞，Hg，mercury，原子序数80，相对原子质量200.59，基态原子电子组态[Xe] 4f14 5d10 6s2，熔点-38.89℃/234.26K，沸点356.7℃/629.85K。IIB族，常见化合价+1、+2。密度13.55g/cm^3。电负度2。",
    
"铊，Tl，thallium，原子序数81，相对原子质量204.383，基态原子电子组态[Xe] 4f14 5d10 6s2 6p1，熔点303.6℃/576.75K，沸点1473℃/1746.15K。IIIA族，常见化合价+1、+3。密度11.85g/cm^3。电负度1.62。",
    
"铅，Pb，lead，原子序数82，相对原子质量207.2，基态原子电子组态[Xe] 4f14 5d10 6s2 6p2，熔点327.4℃/600.55K，沸点1749℃/2022.15K。IVA族，常见化合价-4、-2、+2。密度11.34g/cm^3。电负度2.33。周期表上原子序数最大而有稳定同位素的元素。",
    
"铋，Bi，bismuth，原子序数83，相对原子质量208.9804，基态原子电子组态[Xe] 4f14 5d10 6s2 6p3，熔点271.3℃/544.45K，沸点1560℃/1833.15K。VA族，常见化合价+3、+5。密度9.8g/cm^3。电负度2.02。",
    
"钋，Po，polonium，原子序数84，相对原子质量208.9824，基态原子电子组态[Xe] 4f14 5d10 6s2 6p4，熔点254℃/527.15K，沸点962℃/1235.15K。VIA族，常见化合价-2、+2、+4。密度9.2g/cm^3。电负度2。",
    
"砹，At，astatine，原子序数85，相对原子质量209.9871，基态原子电子组态[Xe] 4f14 5d10 6s2 6p5，熔点230℃/503.15K，沸点336.8℃/609.95K。VIIA族，常见化合价-1、+1。密度6.4g/cm^3。电负度2.2。",
    
"氡，Rn，radon，原子序数86，相对原子质量222.0176，基态原子电子组态[Xe] 4f14 5d10 6s2 6p6，熔点-71.15℃/202.0K，沸点-61.7℃/211.45K。0族。密度0.0098g/cm^3。",
    
"钫，Fr，francium，原子序数87，相对原子质量223.0197，基态原子电子组态[Rn] 7s1，熔点8℃/281.15K，沸点676.8℃/949.95K。IA族，常见化合价+1。密度2.48g/cm^3。电负度0.7。",
    
"镭，Ra，radium，原子序数88，相对原子质量226.0254，基态原子电子组态[Rn]7s2，熔点696℃/969.15K，沸点1737℃/2010.15K。IIA族，常见化合价+2。密度5.5g/cm^3。电负度0.9。",
    
"锕，Ac，actinium，原子序数89，相对原子质量227.0278，基态原子电子组态[Rn]6d1 7s2，熔点1050℃/1323.15K，沸点3197℃/3470.15K。IIIB族，常见化合价+3。密度10.07g/cm^3。电负度1.1。",

"钍，Th，thorium，原子序数90，相对原子质量232.0380，基态原子电子组态[Rn]6d2 7s2，熔点1750℃/2023.15K，沸点4787℃/5060.15K。常见化合价+4。密度11.72g/cm^3。电负度1.3。",
    
"镤，Pa，protactinium，原子序数91，相对原子质量231.0358，基态原子电子组态[Rn]5f2 6d1 7s2，熔点1840℃/2113.15K，沸点4027℃/4300.15K。常见化合价+4、+5。密度15.37g/cm^3。电负度1.5。",
    
"铀，U，uranium，原子序数92，相对原子质量238.0289，基态原子电子组态[Rn]5f3 6d1 7s2，熔点1132.4℃/1405.55K，沸点4131℃/4404.15K。常见化合价+3、+4、+5、+6。密度19.05g/cm^3。电负度1.38。",
    
"镎，Np，neptunium，原子序数93，相对原子质量237.0482，基态原子电子组态[Rn]5f4 6d1 7s2，熔点644℃/917.15K，沸点3902℃/4175.15K。常见化合价+3、+4、+5、+6。密度20.48g/cm^3。电负度1.36。",
    
"钚，Pu，plutonium，原子序数94，相对原子质量244.0642，基态原子电子组态[Rn]5f6 7s2，熔点641℃/914.15K，沸点3232℃/3505.15K。常见化合价+3、+4、+5、+6。密度19.74g/cm^3。电负度1.28。",
    
"镅，Am，americium，原子序数95，相对原子质量243.0614，基态原子电子组态[Rn]5f7 7s2，熔点1176℃/1449.15K，沸点2607℃/2880.15K。常见化合价+3、+4、+5、+6。密度13.67g/cm^3。电负度1.3。",
    
"锔，Cm，curium，原子序数96，相对原子质量247.0803，基态原子电子组态[Rn]5f7 6d1 7s2，熔点1345℃/1618.15K，沸点3110℃/3383.15K。常见化合价+3。密度13.51g/cm^3。电负度1.3。",
    
"锫，Bk，berkelium，原子序数97，相对原子质量247.0703，基态原子电子组态[Rn]5f9 7s2，熔点986℃/1259.15K，沸点2627℃/2900.15K。常见化合价+3、+4。密度13.25g/cm^3。电负度1.3。",
    
"锎，Cf，californium，原子序数98，相对原子质量251.0796，基态原子电子组态[Rn]5f10 7s2，熔点900℃/1173.15K，沸点1472℃/1745.15K。常见化合价+3。密度15.1g/cm^3。电负度1.3。",
    
"锿，Es，einsteinium，原子序数99，相对原子质量252.0829，基态原子电子组态[Rn]5f11 7s2。常见化合价+3。密度13.5g/cm^3。电负度1.3。",
    
"镄，Fm，fermium，原子序数100，相对原子质量257.0951，基态原子电子组态[Rn]5f12 7s2，熔点1525℃/1798K。常见化合价+3。密度19.050g/cm^3。电负度1.3。",
    
"钔，Md，Mendelevium，原子序数101，相对原子质量258.0951，基态原子电子组态[Rn]5f13 7s2，熔点825℃/1098.15K。常见化合价+2、+3。电负度1.3。",
    
"锘，No，Nobelium，原子序数102，相对原子质量259.1009，基态原子电子组态[Rn]5f14 7s2，熔点825℃/1098.15K。常见化合价+3。电负度1.3。",
    
"铹，Lr，Lawrencium，原子序数103，相对原子质量266.1193，基态原子电子组态[Rn]5f14 7s2 7p1，熔点1625℃/1898.15K。",
    
"𬬻，钅卢，Rf，rutherfordium，原子序数104，相对原子质量261，基态原子电子组态[Rn] 5f14 6d2 7s2，熔点2100℃/2373.15K，沸点5500℃/5773.15K。IVB族。密度23g/cm^3。",
    
"𬭊，钅杜，Db，dubinium，原子序数105，相对原子质量262，基态原子电子组态[Rn] 5f14 6d3 7s2。VB族。密度29g/cm^3。",
    
"𬭳，钅喜，Sg，seaborgium，原子序数106，相对原子质量269，基态原子电子组态[Rn] 5f14 6d4 7s2。VIB族。密度35g/cm^3。",
    
"𬭛，钅波，Bh，bohrium，原子序数107，相对原子质量267，基态原子电子组态[Rn] 5f14 6d5 7s2。VIIB族。密度37g/cm^3。",
    
"𬭶，钅黑，Hs，hassium，原子序数108，相对原子质量269，基态原子电子组态[Rn] 5f14 6d6 7s2。VIIIB族。",
    
"鿏，钅麦，Mt，meitnerium，原子序数109，相对原子质量278，基态原子电子组态[Rn] 5f14 6d7 7s2。VIIIB族。密度37.4g/cm^3。",
    
"𫟼，钅达，Ds，darmstadtium，原子序数110，相对原子质量281.1620，基态原子电子组态[Rn] 5f14 6d8 7s2。VIIIB族。密度34.8g/cm^3。",
    
"𬬭，钅仑，Rg，roentgenium，原子序数111，相对原子质量281.1684，基态原子电子组态[Rn] 5f14 6d9 7s2。IB族。",
    
"鎶，钅哥，Cn，copernicium，原子序数112，相对原子质量285.1744，基态原子电子组态[Rn] 5f14 6d10 7s2。IIB族。密度20g/cm^3。",

"钅尔，Nh，nihonium，原子序数113，相对原子质量286.1810，基态原子电子组态[Rn] 5f14 6d10 7s2 7p1，熔点425℃/698.15K，沸点1155℃/1428.15K。IIIA族。密度16g/cm^3。",
    
"𫓧，钅夫，Fl，flerovium，原子序数114，相对原子质量289，基态原子电子组态[Rn] 5f14 6d10 7s2 7p2，熔点68℃/341.15K，沸点146℃/419.15K。IVA族。密度14g/cm^3。",
    
"镆，钅莫，Mc，moscovium，原子序数115，相对原子质量289，基态原子电子组态[Rn] 5f14 6d10 7s2 7p3。VA族。密度13.5g/cm^3。",

"𫟷，钅立，Lv，livermorium，原子序数116，相对原子质量293，基态原子电子组态[Rn] 5f14 6d10 7s2 7p4。VIA族。",
    
"石田，Ts，tennessine，原子序数117，相对原子质量294，基态原子电子组态[Rn] 5f14 6d10 7s2 7p5。VIIA族。",

"奥气，Og，oganesson，原子序数118，相对原子质量294，基态原子电子组态[Rn] 5f14 6d10 7s2 7p6，沸点95℃/368.15K。0族。密度5g/cm^3。"
    }

function draw(msg)
    do
        return "舍勒翻开了元素资料册的一页：\n"..elem[math.random(#elem)]
    end
end

function draw1(msg)
    do
        return "舍勒拿出了一叠卡片，抽出1张：\n"..elem[math.random(#elem)]
    end
end


function draw2(msg)
    do
        return "舍勒拿出了一叠卡片，抽出2张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

function draw3(msg)
    do
        return "舍勒拿出了一叠卡片，抽出3张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

function draw4(msg)
    do
        return "舍勒拿出了一叠卡片，抽出4张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

function draw5(msg)
    do
        return "舍勒拿出了一叠卡片，抽出5张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

function draw6(msg)
    do
        return "舍勒拿出了一叠卡片，抽出6张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

function draw7(msg)
    do
        return "舍勒拿出了一叠卡片，抽出7张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

function draw8(msg)
    do
        return "舍勒拿出了一叠卡片，抽出8张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

function draw9(msg)
    do
        return "舍勒拿出了一叠卡片，抽出9张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

function draw10(msg)
    do
        return "舍勒拿出了一叠卡片，抽出10张：\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)].."\n"..elem[math.random(#elem)]
    end
end

local strtoosmall = "没有0号元素及负数原子序数元素的资料！"
local strtoobig = "暂时未记载原子序数119号及以上的元素……"

function element(msg)
m = string.match(msg.msg,"[0-9]+")
n = tonumber(m)
if n > 118 then
    return strtoobig
elseif n < 1 then
    return strtoosmall
else do
        return elem[n]
end
end
end

function descr(msg)
    do
        return "按原子序号查询化学元素简介：\n.elem 原子序号 或 。elem 原子序号\n抽取元素简介：\n.elem draw 或 。elem draw"
    end

end
end


command["(\\.|。)elem\\s(\\d+)"] = "element"
command["(\\.|。)elem draw"] = "draw"
command["(\\.|。)elem draw 1"] = "draw1"
command["(\\.|。)elem draw 2"] = "draw2"
command["(\\.|。)elem draw 3"] = "draw3"
command["(\\.|。)elem draw 4"] = "draw4"
command["(\\.|。)elem draw 5"] = "draw5"
command["(\\.|。)elem draw 6"] = "draw6"
command["(\\.|。)elem draw 7"] = "draw7"
command["(\\.|。)elem draw 8"] = "draw8"
command["(\\.|。)elem draw 9"] = "draw9"
command["(\\.|。)elem draw 10"] = "draw10"
command["(\\.|。)elem"]= "descr"